---
kind: type
id: T:Autodesk.Revit.DB.Analysis.gbXMLBuildingOperatingSchedule
source: html/67ffcea7-1ebd-78c2-d8f3-b6cc5c3595d2.htm
---
# Autodesk.Revit.DB.Analysis.gbXMLBuildingOperatingSchedule

Enumerations for gbXML (Green Building XML) format, used for energy
 analysis, schema version 0.34.

## Syntax (C#)
```csharp
public enum gbXMLBuildingOperatingSchedule
```

## Remarks
This enumeration corresponds to the buildingType attribute in gbXML and
 is used to specify the building operating schedule.